{"intents": [
    {"tag": "greeting",
     "patterns": ["Hi", "Is anyone there?", "Hello", "Good day","Hey","Hola"],
     "responses": ["Hello, thanks for visiting", "Good to see you again"]
    },
    {"tag": "goodbye",
     "patterns": ["Bye", "See you later", "Goodbye"],
     "responses": ["See you later, thanks for visiting", "Have a nice day", "Bye! Come back again soon."]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you","Thankyou", "That's helpful"],
     "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {"tag": "hours",
     "patterns": ["What hours are you open?", "What are your hours?", "When are you open?" ],
     "responses": ["We're open every day 9am-9pm", "Our hours are 9am-9pm every day"]
    },
    {"tag": "mopeds",
     "patterns": ["Which mopeds do you have?", "What kinds of mopeds are there?", "What do you rent?" ],
     "responses": ["We rent Yamaha, Piaggio and Vespa mopeds", "We have Piaggio, Vespa and Yamaha mopeds"]
    },
    {"tag": "payments",
     "patterns": ["Do you take credit cards?", "Do you accept Mastercard?", "Are you cash only?" ],
     "responses": ["We accept VISA, Mastercard and AMEX", "We accept most major credit cards"]
    },
    {"tag": "opentoday",
     "patterns": ["Are you open today?", "When do you open today?", "What are your hours today?"],
     "responses": ["We're open every day from 9am-9pm", "Our hours are 9am-9pm every day"]
    },
    {"tag": "rental",
     "patterns": [ "I'd like to rent a moped", "How does this work?" ],
     "responses": ["Are you looking to rent today or later this week?"],
     "context_set": "rentalday"
    },
    {"tag": "today",
     "patterns": ["today"],
     "responses": ["For rentals today please call 1-800-MYMOPED", "Same-day rentals please call 1-800-MYMOPED"],
     "context_filter": "rentalday"
    },
    {"tag": "joke",
        "patterns" : ["can you tell me a joke","tell me a funny joke"],
        "responses":["What did the snail who was riding on the turtle's back say? Wheeeee!","Why did the egg hide? It was a little chicken.","How do celebrities stay cool? They have many fans."]
    },
    {"tag": "location",
        "patterns" : ["my current location","my location","current location","can you provide me current location"],
        "responses":["<a href='https://animeloverss2.000webhostapp.com/current.html' target='_blank' style='color:white;'>Here's your location just click</a>"]
    },
    {"tag": "library borrowing policy",
        "patterns" : ["Is it permissible for students to borrow books from the library?","Are students granted permission to borrow library books?","Do students have the privilege to borrow books from the library?","Are library books available for student borrowing?","Are students authorized to take out library books on loan?","Are library book loans accessible to students?","Do students have the opportunity to borrow books from the library?","Are library book borrowings permitted for students?","Are students granted the right to borrow books from the library?","Is it within the rules for students to borrow library books?"],
        "responses":["Library cards enable students to borrow books from the library.","The library grants students the ability to borrow books through their library cards.","Students have the option of borrowing library books by utilizing their library cards.","It is possible for students to borrow library books using their library cards.","The library extends borrowing privileges to students through their library cards.","Students are empowered to borrow books from the library with the help of their library cards.","Through their library cards, students gain access to the library's book borrowing service."]
    },
    {"tag": "borrowing limits of library",
        "patterns" : ["What is the maximum number of books that can be borrowed simultaneously?","How many books are allowed to be borrowed at one time?","Is there a limit to the number of books that can be borrowed concurrently?","What is the cap on the quantity of books that can be borrowed at a given time?","What is the maximum book borrowing limit per person?","Can you please specify the maximum number of books that can be borrowed at once?","Is there a restriction on the number of books that can be borrowed concurrently?","How many books can an individual borrow at the same time?","Is there a specific number of books that can be borrowed simultaneously?","Could you please provide information on the maximum book borrowing allowance?","How many books a student can take at home?"],
        "responses":["Each student is allowed to borrow a single book using their Home Issue Card and another book using their Study Room Card.","Students have the opportunity to borrow one book using their Home Issue Card as well as one book using their Study Room Card.","With their Home Issue Card, students can borrow one book, and with their Study Room Card, they can borrow another book.","The borrowing policy permits students to have one book on loan with their Home Issue Card and another book with their Study Room Card.","Students are eligible to borrow one book on their Home Issue Card and another book on their Study Room Card.","By presenting their Home Issue Card, students can borrow a book, and by presenting their Study Room Card, they can borrow another book.","Students can take out one book using their Home Issue Card and one book using their Study Room Card."]
    },
    {"tag": "borrowing duration",
        "patterns" : ["What is the loan period for library books?","How long can library books be borrowed for?","What is the duration of the borrowing period for library books?","What is the maximum time allowed to keep library books on loan?","How many days are library books available for borrowing?","What is the allowed timeframe for borrowing library books?","Can you please specify the number of days that library books can be borrowed?","Is there a set loan period for library books?","How many days are individuals permitted to keep library books in their possession?","Could you provide information on the borrowing duration for library books?","How many days borrow a book?","How many days can i take a book at home"],
        "responses":["Books borrowed on the Home Issue Card must be returned within a period of 7 days, while books borrowed on the Study Room Card are strictly for in-library reading and should not be taken outside the library premises.","The borrowing period for books taken out on the Home Issue Card is limited to 7 days, whereas books borrowed on the Study Room Card are intended solely for on-site reading and must not be removed from the library premises.","When borrowing a book using the Home Issue Card, students are required to return it within 7 days. Conversely, books borrowed on the Study Room Card are designated for reading exclusively within the library premises and should not be taken outside.","Students are granted a 7-day borrowing window for books checked out on their Home Issue Card, whereas books borrowed on the Study Room Card are strictly reserved for reading within the library and should not be taken off-site.","The Home Issue Card allows students to borrow books for a maximum duration of 7 days, after which they must be returned. On the other hand, books borrowed on the Study Room Card are strictly meant for in-library reading and cannot be taken beyond the premises.","Books borrowed on the Home Issue Card must be returned within 7 days, adhering to the library's borrowing policy. Simultaneously, books borrowed on the Study Room Card are solely intended for on-site reading and should not be removed from the library premises."]
    },
    {"tag": "student access to ebooks and e-journals",
        "patterns" : ["Are students provided with access to ebooks and electronic journals (e-journals)?","Do students have the privilege of accessing ebooks and ejournals?","Are ebooks and electronic journals (e-journals) available for student use?","Is there student access to ebooks and ejournals?","Are students granted permission to utilize ebooks and electronic journals (e-journals)?","Can students avail themselves of ebooks and ejournals?","Do students have the opportunity to access ebooks and electronic journals (e-journals)?","Are ebooks and ejournals accessible to students?","Are students allowed to utilize ebooks and electronic journals (e-journals)?","Is there student availability of ebooks and ejournals?"],
        "responses":["The N-LIST program provides students with access to an extensive collection of over 6,000+ e-journals and more than 1,99,500 ebooks. To obtain the user ID and password, students can reach out to the Librarian.","Under the N-LIST program, students can avail themselves of a vast array of resources, including 6,000+ e-journals and over 1,99,500 ebooks. For access credentials, students can contact the Librarian.","Students have the opportunity to utilize the N-LIST program, granting them access to an extensive collection of more than 6,000+ e-journals and 1,99,500+ ebooks. To obtain the user ID and password, students can consult the Librarian.","Accessible through the N-LIST program, students have the privilege of exploring a wide range of resources, including 6,000+ e-journals and over 1,99,500 ebooks. Students can obtain their user ID and password by contacting the Librarian.","The N-LIST program empowers students with access to an extensive collection comprising 6,000+ e-journals and more than 1,99,500 ebooks. To acquire the user ID and password, students are advised to contact the Librarian."]
    },
    {"tag": "library e-resource",
        "patterns" : ["Besides ebooks and ejournals, do students have access to other electronic resources?","Are there additional electronic resources available to students apart from ebooks and ejournals?","Can students access any other e-resources besides ebooks and ejournals?","Are there supplementary electronic resources accessible to students?","In addition to ebooks and ejournals, are students provided with access to any other e-resources?","Do students have the privilege of accessing other electronic resources apart from ebooks and ejournals?","Are there any other e-resources that students can utilize besides ebooks and ejournals?","Are students granted access to additional electronic resources in addition to ebooks and ejournals?","Can students avail themselves of any other e-resources apart from ebooks and ejournals?","Besides ebooks and ejournals, are there any other electronic resources accessible to students?"],
        "responses":["Through the E-Resources Page of the Library Website, students have the ability to access an extensive collection of over 60 crore open access digital resources.","The Library Website's E-Resources Page provides students with the opportunity to explore and utilize more than 60 crore open access digital resources.","Students can avail themselves of a vast collection of over 60 crore open access digital resources by accessing the E-Resources Page on the Library Website.","The E-Resources Page on the Library Website grants students access to an impressive compilation of over 60 crore open access digital resources.","More than 60 crore open access digital resources are readily accessible to students through the dedicated E-Resources Page on the Library Website."]
    },
    {"tag": "free student access to e-resources",
        "patterns" : ["Are there any additional charges for students to access e-resources?","Do students need to pay extra fees for accessing e-resources?","Is there a cost associated with student access to e-resources?","Are there any supplementary charges for students to obtain access to e-resources?","Do students incur any additional expenses for accessing e-resources?","Is there a fee or subscription required for students to access e-resources?","Are there any financial obligations for students to access e-resources?","Do students have to pay any extra fees to utilize e-resources?","Are there any costs associated with student access to e-resources?","Is there a separate charge for students to gain access to e-resources?"],
        "responses":["Students enjoy complimentary access to the e-resources provided by the library.","Access to the library's e-resources is available to students free of charge.","The library offers students unrestricted and cost-free access to its e-resources.","Students are granted complimentary access to a wide range of e-resources through the library.","Free access to e-resources is provided to students by the library.","The library extends free-of-cost access to its e-resources for the benefit of students."]
    },
    {"tag": "library website",
        "patterns" : ["Is there an official website for the Library?","Does the Library maintain an online presence through a dedicated website?","Can I find the Library's website on the internet?","Is there a web portal for accessing information about the Library?","Does the Library have an online platform in the form of a website?","Is there an active website where I can find details about the Library?","Can I visit the Library's website for more information?","Is there an official online site specifically designed for the Library?","Is there an accessible web page dedicated to the Library's services and resources?","Can I explore the Library's online website to learn more about its offerings?"],
        "responses":["The library has its own dedicated website, which can be accessed through the link provided on the College website or directly at <a href='https://vazecollegelibrary.weebly.com' target='_blank' style='color:white;'>https://vazecollegelibrary.weebly.com/</a>.","Access to the library's dedicated website is available either via the link provided on the College website or by visiting <a href='https://vazecollegelibrary.weebly.com' target='_blank' style='color:white;'>https://vazecollegelibrary.weebly.com/</a>.","Students can reach the library's dedicated website by following the link provided on the College website or by directly visiting <a href='https://vazecollegelibrary.weebly.com' target='_blank' style='color:white;'>https://vazecollegelibrary.weebly.com/</a>.","For convenient access to the library's resources and information, students can visit the dedicated website via the link on the College website or directly through <a href='https://vazecollegelibrary.weebly.com' target='_blank' style='color:white;'>https://vazecollegelibrary.weebly.com/</a>.","The library's dedicated website, located at <a href='https://vazecollegelibrary.weebly.com' target='_blank' style='color:white;'>https://vazecollegelibrary.weebly.com/</a>, can be accessed through the link provided on the College website or directly by entering the URL."]
    },
    {"tag": "library catalog",
        "patterns" : ["Is there a way to find out the availability of specific books in the library?","Can I obtain information about the books currently present in the library?","Is it possible to access a list of books that are currently available in the library?","Can I find out which books are in stock at the library?","Is there a means to check the availability of particular books in the library's collection?","Can I inquire about the presence of specific books in the library?","Is there a system or catalog that provides information on the books available in the library?","Is it feasible to obtain a list of books that are currently accessible in the library?","Can I retrieve details about the availability of books in the library's inventory?","Is there a method to check if specific books are currently present in the library?"],
        "responses":["To access the Library's catalogue, students can visit the WebOPAC page on the Library website. By utilizing the search options such as 'Title', 'Author', 'Publisher', etc., students can easily search for books in the library catalogue. User guides for accessing WebOPAC are readily available on the website.","The Library website features a dedicated WebOPAC page, allowing students to connect to the Library catalogue. Students can conveniently search for books in the library catalogue using search criteria such as 'Title', 'Author', 'Publisher', and more. Detailed user guides for accessing WebOPAC can be found on the website.","Access to the Library catalogue is facilitated through the WebOPAC page on the Library website. By utilizing the search fields like 'Title', 'Author', 'Publisher', etc., students can efficiently search for books in the library catalogue. User guides that provide instructions for accessing WebOPAC are provided on the website.","Students can connect to the Library catalogue by visiting the WebOPAC page on the Library website. By employing search options like 'Title', 'Author', 'Publisher', and others, students can easily locate books in the library catalogue. Detailed user guides explaining the process of accessing WebOPAC are accessible on the website.","The Library website hosts a WebOPAC page that enables students to access the Library catalogue. By entering specific search criteria such as 'Title', 'Author', 'Publisher', and more, students can efficiently search for books in the library catalogue. User guides outlining the steps for accessing WebOPAC are provided on the website."]
    },
    {"tag": " library reading rooms",
        "patterns" : ["Is there a designated reading room within the library?","Does the library provide a separate area or room for reading purposes?","Is there a dedicated space in the library specifically designated as a reading room?","Can library users access a reading room facility within the library premises?","Is there a designated area within the library where individuals can engage in reading activities?","Does the library offer a quiet space or reading room for visitors?","Is there a specific room or section in the library intended for reading purposes?","Are there designated seating areas within the library that serve as a reading room?","Can library patrons make use of a reading room within the library?","Is there a separate area within the library premises that serves as a reading room?"],
        "responses":["The library is equipped with four reading rooms, each located in different sections: Main Library, Periodical Section, Reference Section, and Self Financing Courses Section.","There are four reading rooms available within the library premises, specifically in the Main Library, Periodical Section, Reference Section, and Self Financing Courses Section.","Students can find dedicated reading rooms in various sections of the library, including the Main Library, Periodical Section, Reference Section, and Self Financing Courses Section.","The library comprises four separate reading rooms, situated in the Main Library, Periodical Section, Reference Section, and Self Financing Courses Section, respectively.","Within the library, there are four designated reading rooms, each situated in the Main Library, Periodical Section, Reference Section, and Self Financing Courses Section."]
    },
    {"tag": "reading room capacity",
        "patterns" : ["How many students can the reading rooms accommodate at once?","What is the maximum capacity of the reading rooms for students?","How many students are allowed to use the reading rooms simultaneously?","Is there a specific limit on the number of students allowed in the reading rooms?","Can you provide information on the student capacity of the reading rooms?","Are there any restrictions on the number of students permitted in the reading rooms?","What is the maximum number of students that the reading rooms can accommodate?","Is there a set student capacity for each of the reading rooms?","Are there any guidelines regarding the number of students allowed in the reading rooms?","Can you specify the maximum student capacity for each of the reading rooms?"],
        "responses":["The combined seating capacity of the reading rooms in the library is 240 students.","The reading rooms in the library can accommodate a total of 240 students.","In total, the reading rooms of the library have a capacity for 240 students.","The reading rooms collectively provide seating for up to 240 students.","With a student capacity of 240, the reading rooms in the library offer ample space for studying."]
    },
    {"tag": "book genres",
        "patterns" : ["What are the different genres of books available in the library?","Can you provide an overview of the book categories present in the library?","In what classifications or genres are the books in the library categorized?","Could you give me a breakdown of the types of books found in the library's collection?","Can you describe the variety of book genres represented in the library?","What kinds of books can one expect to find when browsing the library's shelves?","Can you provide information on the different literary genres encompassed by the library's book collection?","How are the books in the library organized in terms of genre or subject matter?","Can you offer insight into the different literary classifications available in the library's inventory?","What specific categories or genres of books can be found within the library's holdings?"],
        "responses":["The library boasts an extensive collection of textbooks and reference books covering a wide range of subjects under the Arts, Science, and Commerce faculties, serving as valuable resources to complement the curricula. Additionally, the collection includes a diverse selection of general reading books, novels, and more.","Students can benefit from the library's vast collection of textbooks and reference books, encompassing various disciplines within the Arts, Science, and Commerce faculties. These resources have been curated to supplement the curricula. Moreover, the library also offers a rich assortment of general reading books and novels.","The library's collection is abundant with textbooks and reference books across multiple subject areas under the Arts, Science, and Commerce faculties. These resources have been specifically chosen to support and enhance the curricula. Furthermore, students can enjoy access to an assortment of general reading books, including novels and other literary works.","With a diverse range of textbooks and reference books, the library caters to the academic needs of students across the Arts, Science, and Commerce faculties. These resources have been thoughtfully selected to complement the curricula. Additionally, students can indulge in a variety of general reading materials, including novels and other engaging literature.","The library houses an expansive collection of textbooks and reference books spanning a wide array of subjects within the Arts, Science, and Commerce faculties. These resources have been curated to supplement the curricula and provide students with comprehensive learning materials. Furthermore, the library offers a selection of general reading books, novels, and other enjoyable literary pieces."]
    },
    {"tag":"principal_of_college",
        "patterns" : ["Who is the principal of college?","current principal","Who is the principal of the vaze","Who is the principal of the V.G. Vaze College of Arts, Science and Commerce (Autonomous)"],
        "responses" : ["The principal of the V.G. Vaze College of Arts, Science and Commerce (Autonomous) is <b>Prof. (Dr.) Preeta Nilesh</b>."],
        "context_set": "principal"
    },
    {"tag": "Preeta Nilesh",
     "patterns": [ "Preeta Nilesh", "Who is Preeta Nilesh", "Prof. (Dr.) Preeta Nilesh", "Who is Prof. (Dr.) Preeta Nilesh?", "Tell me more about principal","Tell me more about Prof. (Dr.) Preeta Nilesh","Tell me more about Preeta Nilesh" ],
     "responses": ["Professor (Dr.) Preeta Nilesh is a highly accomplished individual who serves as a college Principal, Head of the History Department, and Dean of Humanities and Social Sciences. With exceptional leadership skills, they effectively manage college administration, shape the curriculum of the history department, and coordinate various departments within the division. Their unwavering commitment to academic excellence and student success shines through their diverse range of responsibilities."],
     "context_filter": "principal"
    },
    {"tag":"founder",
        "patterns" : ["Who is the founder of the college?","Who is the founder of the vaze?","Who is the founder of the V.G. Vaze College of Arts, Science and Commerce (Autonomous)"],
        "responses" : ["The esteemed founder of V.G. Vaze College of Arts, Science and Commerce (Autonomous) is Mr. Ramesh Vaze.","Mr. Ramesh Vaze is credited as the individual who established V.G. Vaze College of Arts, Science and Commerce (Autonomous)."]
    },
    {"tag":"streams_in_junior_college",
        "patterns" : ["streams in junior college","What are the streams in junior college?","Could you please list the different academic disciplines or streams available in junior college?","What are the areas of study offered in junior college?","Can you provide information about the various streams of study in junior college?","Can you share the available streams of study that students can pursue during their junior college education?","Could you provide an overview of the streams or academic tracks that students can opt for in junior college?"],
        "responses" : ["The Streams offered in Junior college are:<br>1. Arts <br>2. Commerce <br>3. Science<br>4. Common<br>"]
    },
    {"tag":"courses_in_junior_college_in_arts",
        "patterns":["courses in junior college in arts","What are the courses in arts in junior college?","Can you provide a list of the academic courses offered in the junior arts stream?","Can you provide information about the course offerings within the arts stream for students at the junior college level?","What are the subject in junior college arts?"]

    }

]
}
